# Даны две строки. Выведите на экран символы, которые есть в обоих строках.


if __name__ == '__main__':
	string_one = 'Арсенал та Вест Хем всерйоз зацікавилися футболістом Манчестер Сіті та збірної України'
	string_two = 'За даними журналістів, обидва клуби приваблюють універсальність українця з якою він здатний посилити'

	set_one = set(string_one)
	set_two = set(string_two)

	print(set_one & set_two)
