# Любой текст от символа "#" до конца строки — это комментарий
# Коментарии игнорируются при выполнении программы

# print — это функция, которая выводит информацию на экран
# параметры (аргументы) функций берутся в круглые скобки
# "Hello, World!" — это строка, которую мы выводим

print("Hello, World!")

# Строки можно обралмять в одинарные кавычки - результат не поменяется
print('Hello, World!')
print(1)
print(2)
print(2 + 28)
print(35 - 5)
print(2 * 15)
print(120 / 4)
print(10 // 8)
print(10 % 8)
print(7 ** 29)
print(1 + 1 * 7)
print((1 + 1) * 7)
print(51 * 25888 - 1234 / 2)

"""
dfsdfsdfsdf
"""
'''
skjdhkfjhsdkjhfsdkdfjh
sdfsdfsdf
sdfsd
f
'''