# Создайте скрипт на языке Python, используя обычный текстовый редактор
# (можно использовать редактор кода, такой как, например, Sublime Text).
# Запустите его при помощи консоли. Запустите его двойным щелчком в проводнике Windows.
# Придумайте, как, используя то, что вы уже выучили, сделать так, чтобы окно консоли не
# закрывалось сразу же после запуска скрипта двойным щелчком.

number_one = 25

number_two = int(input("Введите число: "))

print(number_one + number_two)
