# Напишите программу, которая спрашивает у пользователя два слова и выводит их разделёнными запятой.

word_one = input("Первое слово для вывода: ")
word_two = input("Второе слово для вывода: ")

print(word_one, word_two, sep=", ", end="\n\n")
print("Слава Україні! Героям слава! Смерть ворогам!")
